app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R')  ORDER BY "movies"."release_date" ASC
---
  def index
    @all_ratings = Movie.all_ratings
    ratings_form = params[:ratings] || {}
    @ratings_to_show = ratings_form.keys

    # Inicializamos las variables de instancia para las clases de columnas
    @sort_column_class_title = nil
    @sort_column_class_date = nil

    # Ordenamos las películas
    case params[:sort]
    when 'name'
      @movies = Movie.with_ratings(@ratings_to_show).order(:title)
      @sort_column_class_title = 'hilite p-3 mb-2 bg-warning text-dark' if params[:sort] == 'name'
    when 'date'
      @movies = Movie.with_ratings(@ratings_to_show).order(:release_date)